DataProcessors/АРМРаботникОхраны_1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АРМРаботникОхраны_1</Name>
			<Comment>Охрана  Пост 1 Чужие Авто</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/АвтоНаТерритории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АвтоНаТерритории</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АвтоЖетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВъездаВыезда</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВъездВыездАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВъездВыездАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВъездВыездАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвтоНаТерритории</xr:Item>
				<xr:Item>AccumulationRegister.АвтоКомпанииНаТерритории</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркиАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникКому</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦельВизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Жетон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоЖетоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботникОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостОхраны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПостыОхраны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМРаботникОхраны_1/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекущееВремяВъезда(Команда)
	Объект.ДатаВремяВъезда=ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ТекущееВремяВыезда(Команда)
	Объект.ДатаВремяВыезда=ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура Въезд(Команда)
	
	ВъездСЕРВЕР();
	Элементы.АвтоНаТерритории.Обновить();
	
КонецПроцедуры

 &НаСервере
Процедура  ВъездСЕРВЕР()
	
	//Проверяем Жетон - возможно уже выдан
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоНаТерриторииОстатки.АвтоЖетон,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.ДатаВремяВъезда,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.МаркаАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.НомерАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.Кому
		|ИЗ
		|	РегистрНакопления.АвтоНаТерритории.Остатки(, АвтоЖетон = &Жетон) КАК АвтоНаТерриторииОстатки
		|ГДЕ
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Жетон", Объект.Жетон);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщить("ОШИБКА!!! "+Строка(Объект.Жетон)+" уже выдан - " + Объект.МаркаАвтомобиля +" "+Объект.НомерАвтомобиля );
		Возврат;
	КонецЕсли;

	
	
	//Проверка на заполнение полей
	Если  Не ЗначениеЗаполнено(Объект.Жетон) Или
		Не ЗначениеЗаполнено(Объект.ДатаВремяВъезда) Или
		Не ЗначениеЗаполнено(Объект.ПостОхраны) Или
		Не ЗначениеЗаполнено(Объект.РаботникОхраны) Или
		Не ЗначениеЗаполнено(Объект.ЦельВизита) Или
		Не ЗначениеЗаполнено(Объект.Поставщик) Или
		Не ЗначениеЗаполнено(Объект.НомерАвтомобиля) Или
		Не ЗначениеЗаполнено(Объект.Кому) Тогда
		
		Сообщить("ОШИБКА!!! Проверьте необходимые поля(помечены красным)");
		Возврат;
	КонецЕсли;
		
	
	//Если все нормально то создаем документ
	Док=Документы.ВъездВыездАвтомобилей.СоздатьДокумент();
	Док.Дата=ТекущаяДата();
	Док.ДатаВремяВъезда=Объект.ДатаВремяВъезда;
	Док.Жетон=Объект.Жетон;
	Док.Кому=Объект.Кому;
	Док.МаркаАвтомобиля=Объект.МаркаАвтомобиля;
	Док.НомерАвтомобиля=Объект.НомерАвтомобиля;
	Док.ПостОхраны=Объект.ПостОхраны;
	Док.РаботникОхраны=Объект.РаботникОхраны;
	Док.ЦельВизита=Объект.ЦельВизита;
	Док.Примечание=Объект.Примечание;
	Док.Поставщик=Объект.Поставщик;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("ОК! Создан документ-"+Док);
КонецПроцедуры


&НаКлиенте
Процедура Выезд(Команда)
	ВыездСЕРВЕР();
	Элементы.АвтоНаТерритории.Обновить();
   	
КонецПроцедуры
 
&НаСервере
Процедура ВыездСЕРВЕР()
	  //Проверяем Жетон - выдан ли он
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоНаТерриторииОстатки.АвтоЖетон,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.ДатаВремяВъезда,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.МаркаАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.НомерАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.Кому
		|ИЗ
		|	РегистрНакопления.АвтоНаТерритории.Остатки(, АвтоЖетон = &Жетон) КАК АвтоНаТерриторииОстатки
		|ГДЕ
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Жетон", Объект.Жетон);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщить("ОШИБКА!!!" +Строка(Объект.Жетон)+" не выдан." );
		Возврат;
	КонецЕсли;

	
	
	//Проверка на заполнение полей
	Если  Не ЗначениеЗаполнено(Объект.Жетон) Или
		Не ЗначениеЗаполнено(Объект.ДатаВремяВъезда) Или
		Не ЗначениеЗаполнено(Объект.ПостОхраны) Или
		Не ЗначениеЗаполнено(Объект.РаботникОхраны) Или
		Не ЗначениеЗаполнено(Объект.ЦельВизита) Или
		Не ЗначениеЗаполнено(Объект.Поставщик) Или
		Не ЗначениеЗаполнено(Объект.НомерАвтомобиля) Или
		Не ЗначениеЗаполнено(Объект.Кому) Тогда
		
		Сообщить("ОШИБКА!!! Проверьте необходимые поля(помечены красным)");
		Возврат;
	КонецЕсли;
	
	//Проверка на заполнение времени выезда
	Если  Не ЗначениеЗаполнено(Объект.ДатаВремяВыезда) Тогда
		Сообщить("ОШИБКА!!! Заполните время выезда");
		Возврат;
	КонецЕсли;
    //Проверка на правильность времен
	Если  Объект.ДатаВремяВъезда>Объект.ДатаВремяВыезда Тогда
		Сообщить("ОШИБКА!!! Время выезда не может быть меньше времени въезда!");
		Возврат;	
	КонецЕсли;
	
	
	
	
	//Если все нормально то создаем документ
	Док=ВыборкаДетальныеЗаписи.ДокументВъездаВыезда.ПолучитьОбъект();
	Док.Дата=ТекущаяДата();
	Док.ДатаВремяВъезда=Объект.ДатаВремяВъезда;
	Док.ДатаВремяВыезда=Объект.ДатаВремяВыезда;
	Док.Жетон=Объект.Жетон;
	Док.Кому=Объект.Кому;
	Док.МаркаАвтомобиля=Объект.МаркаАвтомобиля;
	Док.НомерАвтомобиля=Объект.НомерАвтомобиля;
	Док.ПостОхраны=Объект.ПостОхраны;
	Док.РаботникОхраны=Объект.РаботникОхраны;
	Док.ЦельВизита=Объект.ЦельВизита;
	Док.Примечание=Объект.Примечание;
	Док.Поставщик= Объект.Поставщик;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	Сообщить("ОК! Изменен -"+Док);

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЖетонПриИзменении(Элемент)
	
	Результат= ПроверитьЖетонСЕРВЕР();

	
	Если Результат Тогда
		Элементы.Въезд.Доступность=Ложь;
		Элементы.Выезд.Доступность=Истина;
	Иначе
		Элементы.Въезд.Доступность=Истина;
		Элементы.Выезд.Доступность=Ложь;
    КонецЕсли;
	   КонецПроцедуры

&НаСервере
Функция ПроверитьЖетонСЕРВЕР()
	 //Проверяем Жетон 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоНаТерриторииОстатки.АвтоЖетон,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда,
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.ДатаВремяВъезда,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.МаркаАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.НомерАвтомобиля,
		|	АвтоНаТерриторииОстатки.ДокументВъездаВыезда.Кому
		|ИЗ
		|	РегистрНакопления.АвтоНаТерритории.Остатки(, АвтоЖетон = &Жетон) КАК АвтоНаТерриторииОстатки
		|ГДЕ
		|	АвтоНаТерриторииОстатки.ЗначениеОстаток > 0";

	Запрос.УстановитьПараметр("Жетон", Объект.Жетон);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		//Заполняем поля от документа
		Док= ВыборкаДетальныеЗаписи.ДокументВъездаВыезда;
		
		
		Объект.ДатаВремяВъезда=Док.ДатаВремяВъезда;
		Объект.ДатаВремяВыезда=Док.ДатаВремяВыезда;
		Объект.Жетон=Док.Жетон;
		Объект.Кому=Док.Кому;
		Объект.МаркаАвтомобиля=Док.МаркаАвтомобиля;
		Объект.НомерАвтомобиля=Док.НомерАвтомобиля;
		Объект.ПостОхраны=Док.ПостОхраны;
		Объект.РаботникОхраны=Док.РаботникОхраны;
		Объект.ЦельВизита=Док.ЦельВизита;
		Объект.Примечание=Док.Примечание;
		Объект.Поставщик=Док.Поставщик;
		
		
		Сообщить(Строка(Объект.Жетон)+" выдан." );
		
		Возврат Истина;
	Иначе
		//Очищаем поля
		Объект.ДатаВремяВъезда="";
		Объект.ДатаВремяВыезда="";
		Объект.Кому="";
		Объект.МаркаАвтомобиля="";
		Объект.НомерАвтомобиля="";
		Объект.ЦельВизита="";
		Объект.Примечание="";

		Возврат Ложь; 
	КонецЕсли;

	
КонецФункции


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	      
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		
		//Проверка заполнен ли Пост
		Если Не ЗначениеЗаполнено(Объект.ПостОхраны) Тогда
			Сообщить("Не выбран ПОСТ ОХРАНЫ.");
			Возврат;	
		КонецЕсли;
		
		ШКЖетон=Данные;
		  //Проверка на ШК Жетона
		  
		  Если Не ПроверитьПрефиксШК(ШКЖетон) Тогда
			  Сообщить("Неверный тип ШК(Не жетоны).");
			  Возврат;		  
		  КонецЕсли;
		  
		  ПоискЖетон=НайтиЖетонПоШкСЕРВЕР(ШКЖетон);
		  Если ПоискЖетон<>Неопределено Тогда
				Объект.Жетон=ПоискЖетон;
				 ЖетонПриИзменении(Элементы.Жетон);
		  КонецЕсли;
		  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
 Функция НайтиЖетонПоШкСЕРВЕР(ШКЖетон)
	 
	 КодЖетона=Сред(ШКЖетон,11,2);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвтоЖетоны.Ссылка,
		|	АвтоЖетоны.Код,
		|	АвтоЖетоны.Наименование,
		|	АвтоЖетоны.ПостОхраны
		|ИЗ
		|	Справочник.АвтоЖетоны КАК АвтоЖетоны
		|ГДЕ
		|	АвтоЖетоны.Код = &Код
		|	И АвтоЖетоны.ПостОхраны = &ПостОхраны";

	Запрос.УстановитьПараметр("Код",КодЖетона);
	Запрос.УстановитьПараметр("ПостОхраны", Объект.ПостОхраны);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Сообщить("Жетон не найден");
		Возврат Неопределено;
	КонецЕсли;

		 
 КонецФункции
 
 &НаСервере
   Функция ПроверитьПрефиксШК(ШКЖетон)
	        //Проверка на ШК Жетона
		  Префикс=Сред(ШКЖетон,1,3);
		  Если Префикс<>Справочники.ПрефиксыОбъектовДляШтрихкодов.АвтоЖетон.Наименование Тогда
			  Возврат Ложь;		  
		  Иначе 
			  Возврат Истина;
		  КонецЕсли;

	   
   КонецФункции

&НаСервере
   Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   
		   //Сообщить(ИмяПользователя());
	   Если ИмяПользователя()="ОхранаПост1" Тогда
		Объект.ПостОхраны=Справочники.ПостыОхраны.НайтиПоКоду("01");   
	   КонецЕсли;
	   
	   Если ИмяПользователя()="ОхранаПост4" Тогда
		Объект.ПостОхраны=Справочники.ПостыОхраны.НайтиПоКоду("04");   
	   КонецЕсли;
	   
	   
   КонецПроцедуры

&НаКлиенте
   Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	   Элементы.ДвиженияАвто.Обновить();
	   Элементы.АвтоНаТерритории.Обновить();
   КонецПроцедуры
